/******************************************************************************

                  版权所有 (C), 2018-2025, GridSatellite

 ******************************************************************************
  文 件 名   : fml_init.h
  版 本 号   : 初稿
  作    者   : wzq
  生成日期   : 2019年5月30日
  最近修改   :
  功能描述   : FML初始化文件
  函数列表   :
  修改历史   :
  1.日    期   : 2019年5月30日
    作    者   : wzq
    修改内容   : 创建文件

******************************************************************************/

#ifndef _FML_INIT_H_
#define _FML_INIT_H_

extern void fml_init(void);

#endif

/*eof*/
