/******************************************************************************

                  版权所有 (C), 2018-2025, GridSatellite

 ******************************************************************************
  文 件 名   : uwb.c
  版 本 号   : 初稿
  作    者   : zxf
  生成日期   : 2021年2月23日
  最近修改   :
  功能描述   : uwb线程初始化
  函数列表   :
              
  修改历史   :
  1.日    期   : 2021年2月23日
    作    者   : zxf
    修改内容   : 创建文件

******************************************************************************/


/*------------------------------头文件------------------------------*/

#include "uwb.h"
#include "drv/meas/meas_distance.h"

osThreadId_t thread_UWB_id=0;

/*------------------------------头文件------------------------------*/


/*------------------------------文件宏------------------------------*/

/*------------------------------文件宏------------------------------*/


/*------------------------------文件变量------------------------------*/

/*------------------------------文件变量------------------------------*/

static U64 thread_UWB_stk[SIZE_4K / 2];
static const osThreadAttr_t thread_UWB_attr = {
  .stack_mem  = &thread_UWB_stk[0],
  .stack_size = sizeof(thread_UWB_stk),
  .priority = osPriorityAboveNormal,
};


/*------------------------------函数声明------------------------------*/

/*------------------------------函数声明------------------------------*/

static void _UWB_thread(void * arg)
{

	while(1)
	{
		meas_distance();//测距
		//delay_ms(1000);
	}

}


void UWB_apl_init(void)
{
	get_device_para();
	DWM1000_init();    //dwm1000初始化
	
	NOTE_PRINT(("start meas distance\r\n"));	
	thread_UWB_id = osThreadNew(_UWB_thread, NULL, &thread_UWB_attr);
	GLOBAL_HEX(thread_UWB_id);

}


