/******************************************************************************

                  版权所有 (C), 2018-2025, GridSatellite

 ******************************************************************************
  文 件 名   : drv_init.h
  版 本 号   : 初稿
  作    者   : wzq
  生成日期   : 2019年5月29日
  最近修改   :
  功能描述   : 驱动初始化头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2019年5月29日
    作    者   : wzq
    修改内容   : 创建文件

******************************************************************************/


#ifndef _DRV_INIT_H_
#define _DRV_INIT_H_

#include "pubdef.h"

extern void drv_init(void);

#endif
/*eof*/
